src/InformationRegisters/КИИ_МониторингОшибокСтатистика/КИИ_МониторингОшибокСтатистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокСтатистика</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КИИ_МониторингОшибокЖурнал/КИИ_МониторингОшибокЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокЖурнал</name>
  <resources>
    <name>ПерваяДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееВхождение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтправок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Критичность</name>
    <type>
      <types>EnumRef.КИИ_УровниКритичности</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроанализированаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаАнализаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленаВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Игнорировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОтИИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КИИ_ЛогЗапросовИИ/КИИ_ЛогЗапросовИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_ЛогЗапросовИИ</name>
  <resources>
    <name>ВходныеТокены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыходныеТокены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсегоТокенов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыходныеТокеныВКеше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОтветаСекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзКеша</name>
    <comment>Истина — ответ вернулся из локального кеша, не от провайдера.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>IDЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КИИ_МоделиИИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗавершения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательскийПромпт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемныйПромпт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияСообщенийJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреляцияАгента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УниверсальнаяДатаВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/КИИ_УровниКритичности/КИИ_УровниКритичности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_УровниКритичности</name>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Критическая</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/КИИ_МониторингОшибокДашборд/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// SPDX-License-Identifier: MIT
// Copyright (c) 2026 Андриянов Роман (Androman.pro)
// https://opensource.org/license/mit
////////////////////////////////////////////////////////////////////////////////
// Дашборд ошибок мониторинга: модель данных, страница и ответы веб-доступа.
// Одна страница на два входа: HTML-поле формы обработки КИИ_ДашбордОшибок (скрипты встроены в страницу)
// и HTTP-сервис КИИ_ДашбордОшибокВеб (скрипты отдельными файлами, данные тем же JSON).
// Графики строит браузер: ECharts 6.1.0 (Apache-2.0, макет echarts_js обработки). Сервер отдает модель
// за 180 дней, периоды 7/30/90 пересчитываются на странице без обращений к базе.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Право смотреть дашборд - право Использование на обработку КИИ_ДашбордОшибок. Его дают полные права
// и роль КИИ_ДашбордОшибокПросмотр, рассчитанная на пользователя веб-доступа.
//
// Возвращаемое значение:
//  Булево - Истина, если текущему пользователю разрешен просмотр дашборда.
//
Функция ПросмотрРазрешен() Экспорт

	Возврат ПравоДоступа("Использование", Метаданные.Обработки.КИИ_ДашбордОшибок);

КонецФункции

// Хеш ошибки для глубокого анализа из формы дашборда: самая частая за период по сумме вхождений
// из статистики (та же мера, что в блоке «что болит»), без ошибок под правилами игнорирования.
// Накопленное число повторений в журнале не годится: старая ошибка с тысячами повторений за историю
// и одним вхождением за неделю обогнала бы свежую.
//
// Параметры:
//  ДатаОкончания - Дата - последний день периода (входит целиком).
//  ПериодДней    - Число - длина периода в днях.
//
// Возвращаемое значение:
//  Строка - хеш ошибки; пустая строка, если вхождений за период нет.
//
Функция ХешСамойЧастойОшибки(Знач ДатаОкончания, Знач ПериодДней) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Статистика.ХешОшибки КАК ХешОшибки,
		|	СУММА(Статистика.Количество) КАК Вхождений
		|ИЗ
		|	РегистрСведений.КИИ_МониторингОшибокСтатистика КАК Статистика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КИИ_МониторингОшибокЖурнал КАК Журнал
		|		ПО Журнал.ХешОшибки = Статистика.ХешОшибки
		|			И НЕ Журнал.Игнорировать
		|ГДЕ
		|	Статистика.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	Статистика.ХешОшибки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вхождений УБЫВ,
		|	ХешОшибки";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаОкончания) - (ПериодДней - 1) * 86400);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ХешОшибки;
	КонецЕсли;
	Возврат "";

КонецФункции

// Настройки страницы по умолчанию: светлая тема, период 30 дней, скрипты встроены в страницу.
//
// Возвращаемое значение:
//  Структура:
//   * Тема                 - Строка - light или dark.
//   * ПериодДней           - Число - 7, 30 или 90: период, открытый при загрузке страницы.
//   * ВстроитьСкрипты      - Булево - Истина для HTML-поля формы, Ложь для веб-доступа.
//   * АдресСкриптов        - Строка - базовый адрес HTTP-сервиса, который отдает скрипты (без завершающего /).
//   * ОбновлятьЧерезСекунд - Число - период автообновления страницы; 0 - без автообновления.
//   * КомандыФормы         - Булево - Истина для HTML-поля формы: на странице видны кнопки команд формы
//                            (обновить, анализ, глубокий анализ, включить регламенты); клик по ним форма
//                            получает в ПриНажатии поля как ссылку «#iikona?command=...&days=...&theme=...»
//                            (см. КИИ_МониторингОшибокДашбордКлиентСервер.КомандаСтраницы).
//   * ТекстГлубокогоАнализа - Строка - результат глубокого анализа для панели на странице; "" - панели нет.
//
Функция НовыеНастройкиСтраницы() Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("Тема", "light");
	Настройки.Вставить("ПериодДней", 30);
	Настройки.Вставить("ВстроитьСкрипты", Истина);
	Настройки.Вставить("АдресСкриптов", "");
	Настройки.Вставить("ОбновлятьЧерезСекунд", 0);
	Настройки.Вставить("КомандыФормы", Ложь);
	Настройки.Вставить("ТекстГлубокогоАнализа", "");
	Возврат Настройки;

КонецФункции

// Страница дашборда с актуальными данными.
//
// Параметры:
//  НастройкиСтраницы - см. КИИ_МониторингОшибокДашборд.НовыеНастройкиСтраницы
//
// Возвращаемое значение:
//  Строка - HTML-документ.
//
Функция СтраницаДашборда(Знач НастройкиСтраницы) Экспорт

	Модель = МодельДашборда(ТекущаяДатаСеанса());
	Возврат СобратьСтраницу(Модель, НастройкиСтраницы);

КонецФункции

// Модель дашборда из регистров мониторинга и журнала запросов ИИ за окно истории по день ДатаОкончания.
// Регистры читаются в привилегированном режиме, но только после проверки права просмотра: пользователю
// веб-доступа не нужны права на регистры мониторинга и на журнал запросов ИИ с текстами промптов.
//
// Параметры:
//  ДатаОкончания - Дата - момент формирования; последний день окна - день этой даты.
//
// Возвращаемое значение:
//  Структура - см. КИИ_МониторингОшибокДашборд.СобратьМодель
//
Функция МодельДашборда(Знач ДатаОкончания) Экспорт

	Если Не ПросмотрРазрешен() Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав для просмотра дашборда ошибок.
			|Нужна роль «Просмотр дашборда ошибок» или право на обработку «Дашборд ошибок».'");
	КонецЕсли;

	Сведения = НовыеСведенияМодели(ДатаОкончания);
	ДатаНачала = Сведения.ДатаОкончания - (Сведения.ДнейИстории - 1) * 86400;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДневнаяСтатистика.Период КАК Период,
		|	ДневнаяСтатистика.ХешОшибки КАК ХешОшибки,
		|	ДневнаяСтатистика.Количество КАК Количество
		|ПОМЕСТИТЬ ВТВхожденияОкна
		|ИЗ
		|	РегистрСведений.КИИ_МониторингОшибокСтатистика КАК ДневнаяСтатистика
		|ГДЕ
		|	ДневнаяСтатистика.Период МЕЖДУ &ДатаНачала И &КонецОкна
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВхожденияОкна.Период КАК Период,
		|	ВхожденияОкна.ХешОшибки КАК ХешОшибки,
		|	ВхожденияОкна.Количество КАК Количество
		|ИЗ
		|	ВТВхожденияОкна КАК ВхожденияОкна
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналОшибок.ХешОшибки КАК ХешОшибки,
		|	ЖурналОшибок.Критичность КАК Критичность,
		|	ПОДСТРОКА(ЖурналОшибок.Метаданные, 1, 200) КАК Метаданные,
		|	ПОДСТРОКА(ЖурналОшибок.Событие, 1, 200) КАК Событие,
		|	ПОДСТРОКА(ЖурналОшибок.ТекстОшибки, 1, 300) КАК ТекстОшибки,
		|	ПОДСТРОКА(ЖурналОшибок.ОписаниеОтИИ, 1, 700) КАК ОписаниеОтИИ,
		|	ЖурналОшибок.Игнорировать КАК Игнорировать,
		|	ЖурналОшибок.ПроанализированаИИ КАК ПроанализированаИИ,
		|	ЖурналОшибок.ОтправленаВТелеграм КАК ОтправленаВТелеграм,
		|	ЖурналОшибок.ПерваяДатаВремя КАК ПерваяДатаВремя,
		|	ЖурналОшибок.ПоследнееВхождение КАК ПоследнееВхождение
		|ИЗ
		|	РегистрСведений.КИИ_МониторингОшибокЖурнал КАК ЖурналОшибок
		|ГДЕ
		|	ЖурналОшибок.ХешОшибки В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ХешиОкна.ХешОшибки КАК ХешОшибки
		|			ИЗ
		|				ВТВхожденияОкна КАК ХешиОкна)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ЗапросыИИ.ДатаЗапроса, ДЕНЬ) КАК День,
		|	СУММА(ЗапросыИИ.ВсегоТокенов) КАК Токены,
		|	СУММА(ЗапросыИИ.СтоимостьОтвета) КАК Стоимость
		|ИЗ
		|	РегистрСведений.КИИ_ЛогЗапросовИИ КАК ЗапросыИИ
		|ГДЕ
		|	ЗапросыИИ.ДатаЗапроса МЕЖДУ &ДатаНачала И &КонецОкна
		|	И НЕ ЗапросыИИ.ИзКеша
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ЗапросыИИ.ДатаЗапроса, ДЕНЬ)";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("КонецОкна", КонецДня(Сведения.ДатаОкончания));
	Результаты = Запрос.ВыполнитьПакет();

	Состояние = КИИ_МониторингОшибок.СостояниеРегламентов();
	Сведения.СборВключен = Состояние.СборВключен;
	Сведения.АнализВключен = Состояние.АнализВключен;
	Сведения.ДатаПоследнегоСбора = КИИ_МониторингОшибокЖР.ПолучитьДатуПоследнегоСбора();

	УстановитьПривилегированныйРежим(Ложь);

	Возврат СобратьМодель(Результаты[1].Выгрузить(), Результаты[2].Выгрузить(), Результаты[3].Выгрузить(), Сведения);

КонецФункции

// Сведения для сборки модели: окно истории, лимит ошибок и состояние мониторинга.
//
// Параметры:
//  ДатаФормирования - Дата - момент формирования модели; последний день окна - день этой даты.
//
// Возвращаемое значение:
//  Структура:
//   * ДатаОкончания       - Дата - начало последнего дня окна.
//   * ДатаФормирования    - Дата - момент формирования, показывается на странице.
//   * ДнейИстории         - Число - длина окна: 90 дней периода и 90 дней для сравнения с прошлым.
//   * ЛимитОшибок         - Число - сколько самых частых ошибок попадает в модель.
//   * ДатаПоследнегоСбора - Дата - последний сбор ошибок из журнала регистрации.
//   * СборВключен         - Булево - регламентное задание сбора ошибок включено.
//   * АнализВключен       - Булево - регламентное задание анализа ИИ включено.
//
Функция НовыеСведенияМодели(Знач ДатаФормирования) Экспорт

	Сведения = Новый Структура;
	Сведения.Вставить("ДатаОкончания", НачалоДня(ДатаФормирования));
	Сведения.Вставить("ДатаФормирования", ДатаФормирования);
	Сведения.Вставить("ДнейИстории", 180);
	Сведения.Вставить("ЛимитОшибок", 2000);
	Сведения.Вставить("ДатаПоследнегоСбора", Дата(1, 1, 1));
	Сведения.Вставить("СборВключен", Ложь);
	Сведения.Вставить("АнализВключен", Ложь);
	Возврат Сведения;

КонецФункции

// Собирает модель дашборда из строк выборок. Чистая функция: к базе не обращается.
//
// Параметры:
//  Вхождения     - ТаблицаЗначений, Массив из Структура - строки с полями Период, ХешОшибки, Количество.
//  ОшибкиЖурнала - ТаблицаЗначений, Массив из Структура - строки журнала ошибок с полями ХешОшибки,
//                  Критичность, Метаданные, Событие, ТекстОшибки, ОписаниеОтИИ, Игнорировать, ПроанализированаИИ,
//                  ОтправленаВТелеграм, ПерваяДатаВремя, ПоследнееВхождение.
//  Расходы       - ТаблицаЗначений, Массив из Структура - строки с полями День, Токены, Стоимость.
//  Сведения      - см. КИИ_МониторингОшибокДашборд.НовыеСведенияМодели
//
// Возвращаемое значение:
//  Структура - модель для страницы (ключи на английском: их читает JavaScript страницы):
//   * generated   - Строка - момент формирования.
//   * lastCollect - Строка - момент последнего сбора, пустая строка, если сбора не было.
//   * collectOn   - Булево - сбор ошибок включен.
//   * analyzeOn   - Булево - анализ ИИ включен.
//   * truncated   - Число - сколько редких ошибок не вошло в модель из-за лимита.
//   * days        - Массив из Строка - дни окна в формате ГГГГ-ММ-ДД от старого к новому.
//   * errors      - Массив из Структура - ошибки по убыванию вхождений за окно:
//     ** level     - Строка - crit, high, mid, low или none.
//     ** object    - Строка - объект метаданных.
//     ** event     - Строка - событие журнала регистрации.
//     ** text      - Строка - текст ошибки, сокращенный.
//     ** ai        - Строка - рекомендация ИИ, сокращенная; пустая, если разбора нет.
//     ** ignored   - Булево - ошибка подпала под правило игнорирования.
//     ** analyzed  - Булево - ошибка разобрана ИИ.
//     ** telegram  - Булево - ошибка отправлена в Телеграм.
//     ** first     - Строка - первое вхождение в формате ГГГГ-ММ-ДДTЧЧ:ММ или пустая строка.
//     ** last      - Строка - последнее вхождение в том же формате или пустая строка.
//     ** counts    - Массив из Массив из Число - пары [индекс дня окна, вхождений за день].
//   * costs       - Массив из Массив из Число - тройки [индекс дня окна, токенов, стоимость] по дням с расходами.
//
Функция СобратьМодель(Знач Вхождения, Знач ОшибкиЖурнала, Знач Расходы, Знач Сведения) Экспорт

	ДатаОкончания = НачалоДня(Сведения.ДатаОкончания);
	ДатаНачала = ДатаОкончания - (Сведения.ДнейИстории - 1) * 86400;

	Дни = Новый Массив;
	ИндексыДней = Новый Соответствие;
	Для НомерДня = 0 По Сведения.ДнейИстории - 1 Цикл
		ДеньОкна = ДатаНачала + НомерДня * 86400;
		Дни.Добавить(Формат(ДеньОкна, "ДФ=yyyy-MM-dd"));
		ИндексыДней.Вставить(ДеньОкна, НомерДня);
	КонецЦикла;

	ВхожденияОшибок = ВхожденияПоХешам(Вхождения, ИндексыДней);

	СтрокиЖурнала = Новый Соответствие;
	Для Каждого СтрокаЖурнала Из ОшибкиЖурнала Цикл
		СтрокиЖурнала.Вставить(СтрокаЖурнала.ХешОшибки, СтрокаЖурнала);
	КонецЦикла;

	Порядок = Новый ТаблицаЗначений;
	Порядок.Колонки.Добавить("ХешОшибки");
	Порядок.Колонки.Добавить("Всего");
	Для Каждого ЭлементВхождений Из ВхожденияОшибок Цикл
		СтрокаПорядка = Порядок.Добавить();
		СтрокаПорядка.ХешОшибки = ЭлементВхождений.Ключ;
		СтрокаПорядка.Всего = ЭлементВхождений.Значение.Всего;
	КонецЦикла;
	Порядок.Сортировать("Всего Убыв, ХешОшибки");

	Ошибки = Новый Массив;
	Для Каждого СтрокаПорядка Из Порядок Цикл
		Если Ошибки.Количество() >= Сведения.ЛимитОшибок Тогда
			Прервать;
		КонецЕсли;
		СтрокаЖурнала = СтрокиЖурнала.Получить(СтрокаПорядка.ХешОшибки);
		Счетчики = ВхожденияОшибок.Получить(СтрокаПорядка.ХешОшибки).Счетчики;
		Ошибки.Добавить(ОшибкаМодели(СтрокаЖурнала, Счетчики));
	КонецЦикла;

	Модель = Новый Структура;
	Модель.Вставить("generated", Формат(Сведения.ДатаФормирования, "ДФ='dd.MM HH:mm'"));
	Если ЗначениеЗаполнено(Сведения.ДатаПоследнегоСбора) Тогда
		Модель.Вставить("lastCollect", Формат(Сведения.ДатаПоследнегоСбора, "ДФ='dd.MM HH:mm'"));
	Иначе
		Модель.Вставить("lastCollect", "");
	КонецЕсли;
	Модель.Вставить("collectOn", Сведения.СборВключен);
	Модель.Вставить("analyzeOn", Сведения.АнализВключен);
	Модель.Вставить("truncated", Порядок.Количество() - Ошибки.Количество());
	Модель.Вставить("days", Дни);
	Модель.Вставить("errors", Ошибки);
	Модель.Вставить("costs", РасходыПоДням(Расходы, ИндексыДней));
	Возврат Модель;

КонецФункции

// Собирает HTML-страницу из модели. Скрипты встраиваются в страницу или подключаются по адресу
// HTTP-сервиса; данные (модель и текст глубокого анализа) кладутся неисполняемым JSON и подставляются последними.
//
// Параметры:
//  Модель            - см. КИИ_МониторингОшибокДашборд.СобратьМодель
//  НастройкиСтраницы - см. КИИ_МониторингОшибокДашборд.НовыеНастройкиСтраницы
//
// Возвращаемое значение:
//  Строка - HTML-документ.
//
Функция СобратьСтраницу(Знач Модель, Знач НастройкиСтраницы) Экспорт

	Настройки = НовыеНастройкиСтраницы();
	ЗаполнитьЗначенияСвойств(Настройки, НастройкиСтраницы);

	Если Настройки.Тема = "dark" Тогда
		Тема = "dark";
	Иначе
		Тема = "light";
	КонецЕсли;

	Если Настройки.ПериодДней = 7 Или Настройки.ПериодДней = 90 Тогда
		ПериодДней = Настройки.ПериодДней;
	Иначе
		ПериодДней = 30;
	КонецЕсли;

	Если Настройки.ВстроитьСкрипты Тогда
		БлокБиблиотеки = "<script>" + ТекстБиблиотеки() + "</script>";
		БлокСкрипта = "<script>" + ТекстСкрипта() + "</script>";
	Иначе
		АдресСкриптов = ЭкранироватьАтрибут(Настройки.АдресСкриптов);
		БлокБиблиотеки = СтрШаблон("<script src=""%1/echarts?v=%2""></script>", АдресСкриптов, ВерсияECharts());
		БлокСкрипта = СтрШаблон("<script src=""%1/script""></script>", АдресСкриптов);
	КонецЕсли;

	// Период автообновления уходит атрибутом data-refresh: страницу перезагружает скрипт по адресу с открытым
	// периодом и темой; meta refresh вернул бы исходный адрес и сбросил выбранный период.
	ПериодОбновления = Формат(?(Настройки.ОбновлятьЧерезСекунд > 0, Настройки.ОбновлятьЧерезСекунд, 0), "ЧН=0; ЧГ=0");

	// Данные подставляются последними: после них в странице ничего не заменяется, поэтому текст ошибки
	// с именем заполнителя не подменит библиотеку или скрипт.
	Страница = Обработки.КИИ_ДашбордОшибок.ПолучитьМакет("ШаблонСтраницы").ПолучитьТекст();
	Страница = СтрЗаменить(Страница, "%ECHARTS_LIBRARY%", БлокБиблиотеки);
	Страница = СтрЗаменить(Страница, "%DASHBOARD_SCRIPT%", БлокСкрипта);
	Страница = СтрЗаменить(Страница, "%DASHBOARD_THEME%", Тема);
	Страница = СтрЗаменить(Страница, "%DASHBOARD_PERIOD%", Формат(ПериодДней, "ЧГ=0"));
	Страница = СтрЗаменить(Страница, "%DASHBOARD_REFRESH%", ПериодОбновления);
	Страница = СтрЗаменить(Страница, "%DASHBOARD_HOST%", ?(Настройки.КомандыФормы, "form", "web"));
	Страница = СтрЗаменить(Страница, "%DASHBOARD_DATA%", ДанныеДляСтраницы(Модель, Настройки.ТекстГлубокогоАнализа));
	Возврат Страница;

КонецФункции

// Ответ веб-доступа к дашборду. Не зависит от объектов HTTP-сервиса, поэтому проверяется тестами;
// обработчики HTTP-сервиса КИИ_ДашбордОшибокВеб только переносят результат в HTTPСервисОтвет.
//
// Параметры:
//  Ресурс           - Строка - page (страница), library (ECharts) или script (скрипт дашборда).
//  БазовыйАдрес     - Строка - базовый URL HTTP-сервиса (HTTPСервисЗапрос.БазовыйURL).
//  ПараметрыЗапроса - Соответствие из КлючИЗначение - параметры строки запроса (у HTTP-сервиса - фиксированное
//                     соответствие, оно тоже принимается): days (7, 30 или 90) и theme (light или dark):
//   * Ключ     - Строка - имя параметра.
//   * Значение - Строка - значение параметра.
//  ПросмотрРазрешен - Булево - право текущего пользователя на просмотр (см. ПросмотрРазрешен).
//
// Возвращаемое значение:
//  Структура:
//   * КодСостояния - Число - HTTP-код ответа.
//   * Заголовки    - Соответствие из КлючИЗначение - HTTP-заголовки ответа:
//     ** Ключ     - Строка - имя заголовка.
//     ** Значение - Строка - значение заголовка.
//   * Тело         - Строка, ДвоичныеДанные - тело ответа.
//
Функция ОтветВеб(Знач Ресурс, Знач БазовыйАдрес, Знач ПараметрыЗапроса, Знач ПросмотрРазрешен) Экспорт

	Если Не ПросмотрРазрешен Тогда
		Возврат ОтветТекстом(403, НСтр("ru = 'Нет права на просмотр дашборда ошибок.
			|Попросите администратора выдать роль «Просмотр дашборда ошибок».'"));
	КонецЕсли;

	Если Ресурс = "page" Тогда

		Настройки = НовыеНастройкиСтраницы();
		Настройки.ВстроитьСкрипты = Ложь;
		Настройки.АдресСкриптов = БазовыйАдресБезСлеша(БазовыйАдрес);
		Настройки.ОбновлятьЧерезСекунд = 300;
		Настройки.ПериодДней = ПериодИзПараметра(ЗначениеПараметраЗапроса(ПараметрыЗапроса, "days"));
		Если ЗначениеПараметраЗапроса(ПараметрыЗапроса, "theme") = "dark" Тогда
			Настройки.Тема = "dark";
		КонецЕсли;

		Ответ = НовыйОтвет(200, "text/html; charset=utf-8", СтраницаДашборда(Настройки));
		Ответ.Заголовки.Вставить("Cache-Control", "no-store");
		Ответ.Заголовки.Вставить("Content-Security-Policy", ПолитикаБезопасностиСодержимого());
		Ответ.Заголовки.Вставить("Referrer-Policy", "no-referrer");
		Ответ.Заголовки.Вставить("X-Frame-Options", "SAMEORIGIN");
		Возврат Ответ;

	ИначеЕсли Ресурс = "library" Тогда

		Ответ = НовыйОтвет(200, "application/javascript; charset=utf-8",
			Обработки.КИИ_ДашбордОшибок.ПолучитьМакет("echarts_js"));
		// Адрес страницы несет версию библиотеки (?v=), поэтому файл можно кешировать надолго.
		Ответ.Заголовки.Вставить("Cache-Control", "private, max-age=604800");
		Возврат Ответ;

	ИначеЕсли Ресурс = "script" Тогда

		Ответ = НовыйОтвет(200, "application/javascript; charset=utf-8", ТекстСкрипта());
		// Скрипт меняется с выпуском расширения, а версии в адресе у него нет - браузер перепроверяет его каждый раз.
		Ответ.Заголовки.Вставить("Cache-Control", "no-cache");
		Возврат Ответ;

	Иначе

		Возврат ОтветТекстом(404, НСтр("ru = 'Нет такого ресурса дашборда ошибок.'"));

	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вхождения окна по хешу ошибки: всего за окно и пары [индекс дня, количество].
Функция ВхожденияПоХешам(Знач Вхождения, Знач ИндексыДней)

	Результат = Новый Соответствие;
	Для Каждого СтрокаВхождений Из Вхождения Цикл
		ИндексДня = ИндексыДней.Получить(НачалоДня(СтрокаВхождений.Период));
		Если ИндексДня = Неопределено Или СтрокаВхождений.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		Накопление = Результат.Получить(СтрокаВхождений.ХешОшибки);
		Если Накопление = Неопределено Тогда
			Накопление = Новый Структура("Всего, Счетчики", 0, Новый Массив);
			Результат.Вставить(СтрокаВхождений.ХешОшибки, Накопление);
		КонецЕсли;

		Пара = Новый Массив;
		Пара.Добавить(ИндексДня);
		Пара.Добавить(СтрокаВхождений.Количество);
		Накопление.Счетчики.Добавить(Пара);
		Накопление.Всего = Накопление.Всего + СтрокаВхождений.Количество;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Ошибка модели из строки журнала. Хеш есть в статистике, но нет в журнале - уровень none и пустые тексты.
Функция ОшибкаМодели(Знач СтрокаЖурнала, Знач Счетчики)

	Ошибка = Новый Структура;
	Ошибка.Вставить("level", "none");
	Ошибка.Вставить("object", "");
	Ошибка.Вставить("event", "");
	Ошибка.Вставить("text", "");
	Ошибка.Вставить("ai", "");
	Ошибка.Вставить("ignored", Ложь);
	Ошибка.Вставить("analyzed", Ложь);
	Ошибка.Вставить("telegram", Ложь);
	Ошибка.Вставить("first", "");
	Ошибка.Вставить("last", "");
	Ошибка.Вставить("counts", Счетчики);

	Если СтрокаЖурнала = Неопределено Тогда
		Возврат Ошибка;
	КонецЕсли;

	Ошибка.level = КодУровня(СтрокаЖурнала.Критичность);
	Ошибка.object = СократитьТекст(СтрокаЖурнала.Метаданные, 200);
	Ошибка.event = СократитьТекст(СтрокаЖурнала.Событие, 200);
	Ошибка.text = СократитьТекст(СтрокаЖурнала.ТекстОшибки, 240);
	Ошибка.ai = СократитьТекст(СтрокаЖурнала.ОписаниеОтИИ, 600);
	Ошибка.ignored = СтрокаЖурнала.Игнорировать = Истина;
	Ошибка.analyzed = СтрокаЖурнала.ПроанализированаИИ = Истина;
	Ошибка.telegram = СтрокаЖурнала.ОтправленаВТелеграм = Истина;
	Ошибка.first = МоментДляСтраницы(СтрокаЖурнала.ПерваяДатаВремя);
	Ошибка.last = МоментДляСтраницы(СтрокаЖурнала.ПоследнееВхождение);
	Возврат Ошибка;

КонецФункции

// Код уровня критичности для страницы; пустая или неизвестная критичность - none (ошибка еще не оценена).
Функция КодУровня(Знач Критичность)

	Если Критичность = Перечисления.КИИ_УровниКритичности.Критическая Тогда
		Возврат "crit";
	ИначеЕсли Критичность = Перечисления.КИИ_УровниКритичности.Высокая Тогда
		Возврат "high";
	ИначеЕсли Критичность = Перечисления.КИИ_УровниКритичности.Средняя Тогда
		Возврат "mid";
	ИначеЕсли Критичность = Перечисления.КИИ_УровниКритичности.Низкая Тогда
		Возврат "low";
	Иначе
		Возврат "none";
	КонецЕсли;

КонецФункции

// Расходы по дням окна: тройки [индекс дня, токенов, стоимость] в порядке дней.
Функция РасходыПоДням(Знач Расходы, Знач ИндексыДней)

	Токены = Новый Соответствие;
	Стоимости = Новый Соответствие;
	Для Каждого СтрокаРасходов Из Расходы Цикл
		ИндексДня = ИндексыДней.Получить(НачалоДня(СтрокаРасходов.День));
		Если ИндексДня = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Токены.Вставить(ИндексДня, ЧислоИлиНоль(Токены.Получить(ИндексДня)) + ЧислоИлиНоль(СтрокаРасходов.Токены));
		Стоимости.Вставить(ИндексДня, ЧислоИлиНоль(Стоимости.Получить(ИндексДня)) + ЧислоИлиНоль(СтрокаРасходов.Стоимость));
	КонецЦикла;

	Результат = Новый Массив;
	Для ИндексДня = 0 По ИндексыДней.Количество() - 1 Цикл
		ТокеныДня = Токены.Получить(ИндексДня);
		Если ТокеныДня = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Тройка = Новый Массив;
		Тройка.Добавить(ИндексДня);
		Тройка.Добавить(ТокеныДня);
		Тройка.Добавить(Окр(Стоимости.Получить(ИндексДня), 4));
		Результат.Добавить(Тройка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ЧислоИлиНоль(Знач Значение)

	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат 0;

КонецФункции

// Момент для страницы в формате ГГГГ-ММ-ДДTЧЧ:ММ; пустая дата - пустая строка.
Функция МоментДляСтраницы(Знач Момент)

	Если ТипЗнч(Момент) <> Тип("Дата") Или Не ЗначениеЗаполнено(Момент) Тогда
		Возврат "";
	КонецЕсли;

	Возврат Формат(Момент, "ДФ=yyyy-MM-dd") + "T" + Формат(Момент, "ДФ=HH:mm");

КонецФункции

Функция СократитьТекст(Знач Текст, Знач МаксимальнаяДлина)

	Если ТипЗнч(Текст) <> Тип("Строка") Тогда
		Возврат "";
	КонецЕсли;

	Текст = СокрЛП(Текст);
	Если СтрДлина(Текст) <= МаксимальнаяДлина Тогда
		Возврат Текст;
	КонецЕсли;

	Возврат Лев(Текст, МаксимальнаяДлина - 1) + "…";

КонецФункции

// JSON данных страницы (модель и текст глубокого анализа под ключом deep) для вставки внутрь
// <script type="application/json">. Символы «<», «>» и «&» записываются JSON-последовательностями
// «обратная косая черта + u003c, u003e, u0026»: JSON.parse вернет исходный текст, а закрыть тег script
// текстом ошибки нельзя. Обратная косая черта - Символ(92): так последовательность не превратится
// обратно в символ ни при какой обработке исходного текста модуля.
Функция ДанныеДляСтраницы(Знач Модель, Знач ТекстГлубокогоАнализа)

	// Копия модели: у вызывающего она не меняется, результат глубокого анализа живет только в данных страницы.
	Данные = Новый Структура;
	Для Каждого Поле Из Модель Цикл
		Данные.Вставить(Поле.Ключ, Поле.Значение);
	КонецЦикла;
	Данные.Вставить("deep", Строка(ТекстГлубокогоАнализа));

	ЗаписьДанных = Новый ЗаписьJSON;
	ЗаписьДанных.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьДанных, Данные);
	ТекстДанных = ЗаписьДанных.Закрыть();

	ОбратнаяКосаяЧерта = Символ(92);
	ТекстДанных = СтрЗаменить(ТекстДанных, "&", ОбратнаяКосаяЧерта + "u0026");
	ТекстДанных = СтрЗаменить(ТекстДанных, "<", ОбратнаяКосаяЧерта + "u003c");
	Возврат СтрЗаменить(ТекстДанных, ">", ОбратнаяКосаяЧерта + "u003e");

КонецФункции

Функция ТекстБиблиотеки()

	Возврат ПолучитьСтрокуИзДвоичныхДанных(Обработки.КИИ_ДашбордОшибок.ПолучитьМакет("echarts_js"),
		КодировкаТекста.UTF8);

КонецФункции

Функция ТекстСкрипта()

	Возврат Обработки.КИИ_ДашбордОшибок.ПолучитьМакет("СкриптДашборда").ПолучитьТекст();

КонецФункции

// Версия ECharts из макета echarts_js: входит в адрес библиотеки, чтобы после обновления библиотеки браузер
// не взял старый файл из кеша.
Функция ВерсияECharts()

	Возврат "6.1.0";

КонецФункции

// Политика для веб-страницы: скрипты только файлами того же сервиса (данные - неисполняемый JSON),
// стили встроенные, внешние запросы, формы и встраивание на чужие сайты запрещены.
Функция ПолитикаБезопасностиСодержимого()

	Возврат "default-src 'none'; script-src 'self'; style-src 'unsafe-inline'; img-src data:; "
		+ "base-uri 'none'; form-action 'none'; frame-ancestors 'self'";

КонецФункции

Функция ЭкранироватьАтрибут(Знач Текст)

	Результат = СтрЗаменить(Строка(Текст), "&", "&amp;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	Результат = СтрЗаменить(Результат, "'", "&#39;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Возврат СтрЗаменить(Результат, ">", "&gt;");

КонецФункции

Функция БазовыйАдресБезСлеша(Знач БазовыйАдрес)

	Адрес = СокрЛП(Строка(БазовыйАдрес));
	Пока СтрЗаканчиваетсяНа(Адрес, "/") Цикл
		Адрес = Лев(Адрес, СтрДлина(Адрес) - 1);
	КонецЦикла;
	Возврат Адрес;

КонецФункции

Функция ЗначениеПараметраЗапроса(Знач ПараметрыЗапроса, Знач ИмяПараметра)

	Если ТипЗнч(ПараметрыЗапроса) <> Тип("Соответствие")
		И ТипЗнч(ПараметрыЗапроса) <> Тип("ФиксированноеСоответствие") Тогда
		Возврат "";
	КонецЕсли;

	Значение = ПараметрыЗапроса.Получить(ИмяПараметра);
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат "";
	КонецЕсли;

	Возврат НРег(СокрЛП(Значение));

КонецФункции

// Период из параметра days: 7 или 90, иначе 30. Строки сравниваются без преобразования в число.
Функция ПериодИзПараметра(Знач ЗначениеПараметра)

	Если ЗначениеПараметра = "7" Тогда
		Возврат 7;
	ИначеЕсли ЗначениеПараметра = "90" Тогда
		Возврат 90;
	Иначе
		Возврат 30;
	КонецЕсли;

КонецФункции

Функция НовыйОтвет(Знач КодСостояния, Знач ТипСодержимого, Знач Тело)

	Ответ = Новый Структура;
	Ответ.Вставить("КодСостояния", КодСостояния);
	Ответ.Вставить("Заголовки", Новый Соответствие);
	Ответ.Вставить("Тело", Тело);
	Ответ.Заголовки.Вставить("Content-Type", ТипСодержимого);
	Ответ.Заголовки.Вставить("X-Content-Type-Options", "nosniff");
	Возврат Ответ;

КонецФункции

Функция ОтветТекстом(Знач КодСостояния, Знач Текст)

	Ответ = НовыйОтвет(КодСостояния, "text/plain; charset=utf-8", Текст);
	Ответ.Заголовки.Вставить("Cache-Control", "no-store");
	Возврат Ответ;

КонецФункции

#КонецОбласти
